[
  {
    "title": "DVHS Computer Science Club",
    "subtext": "Club Secretary",
    "logo": "/logos/dvhs-cs-club.png",
    "date": "August 2025 - May 2026",
    "details": "Will be managing club communications, organizing events, and documenting meeting proceedings. I will also help coordinate workshops and hackathons that encourages students to explore various aspects of computer science in this role."
  },
  {
    "title": "Tulip Coaching",
    "subtext": "Founder & Instructor",
    "logo": "/logos/tulip-coaching.png",
    "date": "June 2025 - Present",
    "details": "Created a tutoring program for middle school students with no experience to learn Python. Developed a curriculum that introduces programming concepts through engaging projects and hands-on exercises. Focused on building foundational skills in coding and problem-solving.",
    "link": "https://tulipcoaching.org"
  },
  {
    "title": "Let's Assist",
    "subtext": "Founder, CEO & Product Dev",
    "logo": "/logos/lets-assist.png",
    "date": "December 2024 - Present",
    "details": "Created a comprehensive online volunteering platform that helps organizations and high school CSF programs manage, automatically track, and coordinate volunteering activities for students and communities. It simplifies the process for organizations to create and manage volunteer events, track student contributions, and verify hours securely using QR codes.",
    "link": "https://lets-assist.com"
  },
  {
    "title": "Windemere Coding Club",
    "subtext": "Club Secretary",
    "logo": "/logos/wrms.png",
    "date": "January 2024 - May 2024",
    "details": "Organized club meetings and facilitated communication between members and faculty advisors. Helped develop educational content to teach fellow students programming fundamentals through hands-on projects."
  },
  {
    "title": "Boy Scouts of America",
    "subtext": "First Class Scout at Troop 941",
    "logo": "/logos/bsa.png",
    "date": "December 2022 - Present",
    "details": "Developed leadership skills and community service experience through active participation in troop activities. Completed numerous merit badges focused on technical skills and outdoor competencies.",
    "link": "https://troop941.org"
  }
]
