[
  {
    "title": "AlphaStar Academy",
    "subtext": "Python Instructor for Paid Internship",
    "logo": "/logos/alphastar.png",
    "date": "September 2025 - May 2026",
    "details": "Mentored economically disadvantaged students for Python 1 & 2 courses in a paid internship as part of the AlphaStar-Carina Scholarship Program. Provided 1:1 instruction for 32 weeks (2 hours/week) during the fall and spring terms. Responsibilities included monitoring student progress, adapting the curriculum to individual learning speeds, and participating in monthly meetings with supervisors to discuss student development.",
    "link": "https://alphastar.academy/carina-scholarship/"
  },
  {
    "title": "DVHS Computer Science Club",
    "subtext": "Club Secretary",
    "logo": "/logos/dvhs-cs-club.png",
    "date": "August 2025 - May 2026",
    "details": "Will be managing club communications, organizing events, and documenting meeting proceedings. I will also help coordinate workshops and hackathons that encourages students to explore various aspects of computer science in this role."
  },
  {
    "title": "Mustang Math",
    "subtext": "Platform Developer for Math Tournament Tech Team",
    "logo": "/logos/mustang-math.png",
    "date": "July 2025 - Present",
    "details": "Worked on the Mustang Math tech team for a national competition with 600+ participants domestically across 7+ states, and 350+ partcipants from over 16 countries internationally. Contributed to developing and maintaining COMPOSE, a custom tournament problem-writing platform used by Mustang Math and Stanford Math Tournament. Participated in weekly team meetings, collaborated with other developers, and contributed to feature development and platform improvements.",
    "link": "https://www.mustangmath.com/our-team"
  },
  {
    "title": "Tulip Coaching",
    "subtext": "Founder & Instructor",
    "logo": "/logos/tulip-coaching.png",
    "date": "June 2025 - Present",
    "details": "Ran a tutoring service for middle school students with no experience to learn Python. Developed a curriculum that introduces programming concepts through engaging projects and hands-on exercises. Currently finished a 4-week course with 5 students, focusing on fundamental foundational skills in programming and continuing in an advanced 8-week course.",
    "link": "https://tulipcoaching.org"
  },
  {
    "title": "Let's Assist",
    "subtext": "Founder, CEO & Product Developer",
    "logo": "/logos/lets-assist.png",
    "date": "December 2024 - Present",
    "details": "Created a comprehensive online volunteering platform that helps organizations and high school CSF programs manage, automatically track, and coordinate volunteering activities for students and communities. It simplifies the process for organizations to create and manage volunteer events, track student contributions, and verify hours securely using QR codes.",
    "link": "https://lets-assist.com"
  },
  {
    "title": "Windemere Coding Club",
    "subtext": "Club Secretary",
    "logo": "/logos/wrms.png",
    "date": "January 2024 - May 2024",
    "details": "Organized club meetings and facilitated communication between members and faculty advisors. Helped develop educational content to teach fellow students programming fundamentals through hands-on projects."
  },
  {
    "title": "Boy Scouts of America",
    "subtext": "First Class Scout at Troop 941",
    "logo": "/logos/bsa.png",
    "date": "December 2022 - Present",
    "details": "Developed leadership skills and community service experience through active participation in troop activities. Completed numerous merit badges focused on technical skills and outdoor competencies.",
    "link": "https://troop941.org"
  }
]
