[
  {
    "id": "personal-portfolio",
    "title": "Personal Portfolio Website",
    "tagline": "A responsive portfolio website built with Next.js and Tailwind CSS",
    "description": "This personal portfolio website showcases my skills, projects, and achievements. Built with Next.js and Tailwind CSS, it features a responsive design, dark mode support, and smooth animations powered by Framer Motion. The site is optimized for performance and SEO, with a focus on accessibility and user experience.\n\nKey features include:\n- Responsive design that works on all devices\n- Dark/light mode toggle with system preference detection\n- Smooth page transitions and scroll animations\n- SEO optimization with Next.js metadata API\n- TypeScript for type safety and better developer experience",
    "image": "/images/placeholder.svg?height=400&width=600",
    "tags": ["Web Development", "React", "Next.js", "Tailwind CSS"],
    "year": "2023",
    "projectLink": "https://riddhimanrana.com",
    "repoLink": "https://github.com/riddhimanrana/portfolio"
  },
  {
    "id": "competitive-programming-solutions",
    "title": "Competitive Programming Solutions",
    "tagline": "A collection of solutions to competitive programming problems",
    "description": "This repository contains my solutions to various competitive programming problems from platforms like USACO, Codeforces, AtCoder, and more. Each solution includes a detailed explanation of the algorithm and approach used to solve the problem.\n\nThe solutions are organized by platform and difficulty, making it easy to find specific problems. I regularly update this repository with new solutions as I solve more problems.\n\nTechnologies used:\n- C++ for most solutions\n- Python for some specific problems\n- Custom testing framework for local testing",
    "image": "/images/placeholder.svg?height=400&width=600",
    "tags": ["Algorithm", "C++", "Competitive Programming", "USACO"],
    "year": "2024",
    "repoLink": "https://github.com/riddhimanrana/competitive-programming"
  },
  {
    "id": "algorithm-visualizer",
    "title": "Algorithm Visualizer",
    "tagline": "Interactive tool for visualizing common algorithms",
    "description": "The Algorithm Visualizer is an interactive web application that helps users understand how various algorithms work through visual representations. Users can adjust parameters, step through algorithms, and see the changes in real-time.\n\nThe visualizer currently supports sorting algorithms (bubble sort, merge sort, quick sort), graph algorithms (BFS, DFS, Dijkstra's), and dynamic programming examples. Each algorithm includes a detailed explanation and time/space complexity analysis.\n\nBuilt with React and D3.js for visualizations, with a clean, intuitive interface that makes learning algorithms more accessible to beginners.",
    "image": "/images/placeholder.svg?height=400&width=600",
    "tags": ["Web Development", "React", "Algorithms", "Educational"],
    "year": "2023",
    "projectLink": "https://algorithm-visualizer.riddhimanrana.com",
    "repoLink": "https://github.com/riddhimanrana/algorithm-visualizer"
  },
  {
    "id": "usaco-training-platform",
    "title": "USACO Training Platform",
    "tagline": "A platform for USACO training with problem sets and tutorials",
    "description": "The USACO Training Platform is a comprehensive resource for students preparing for the USA Computing Olympiad. It features curated problem sets, detailed tutorials, and a judge system for submitting and testing solutions.\n\nThe platform organizes content by USACO division (Bronze, Silver, Gold, Platinum) and topic, making it easy for users to focus on specific areas they need to improve. Each problem includes hints, solution approaches, and complexity analysis.\n\nThe backend is built with Node.js and Express, with a PostgreSQL database for storing user progress and submissions. The frontend uses React with TypeScript and Tailwind CSS for a responsive, user-friendly interface.",
    "image": "/images/placeholder.svg?height=400&width=600",
    "tags": ["Full Stack", "React", "Node.js", "Educational", "USACO"],
    "year": "2024",
    "projectLink": "https://usaco-training.riddhimanrana.com"
  }
]
